Infineon/mtb-example-psoc6-motion-sensor-freertos/motion_task.c
/******************************************************************************
* File Name:   motion_task.c
*
* Description: This file contains the task that initializes and configures the
*              BMI160/BMI270 Motion Sensor; and displays the sensor orientation.
*
* Related Document: See README.md
*
*
*******************************************************************************
* Copyright 2021-2024, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
*
* This software, including source code, documentation and related
* materials ("Software") is owned by Cypress Semiconductor Corporation
* or one of its affiliates ("Cypress") and is protected by and subject to
* worldwide patent protection (United States and foreign),
* United States copyright laws and international treaty provisions.
* Therefore, you may use this Software only as provided in the license
* agreement accompanying the software package from which you
* obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software
* source code solely for use in connection with Cypress's
* integrated circuit products.  Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/

#include "mtb_bmi160.h"
#include "mtb_bmi270.h"
#include "motion_task.h"
#include "cy_pdl.h"
#include "cyhal.h"
#include "cybsp.h"
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include "cy_retarget_io.h"

/******************************************************************************
* Macros
******************************************************************************/
/* Macro to check if the result of an operation was successful. When it has
 * failed, print the error message and suspend the task.
 */
#define CHECK_RESULT(result, error_message...)                        \
                     do                                               \
                     {                                                \
                         if ((cy_rslt_t)result != CY_RSLT_SUCCESS)    \
                         {                                            \
                             printf(error_message);                   \
                             vTaskSuspend(NULL);                      \
                         }                                            \
                     } while(0)

/* Check if the EPD and TFT shields are being used with non Pioneer kits and
 * throw a compile-time error accordingly.
 */
#if (!defined(CYBSP_D0) && (INTERFACE_USED == CY8CKIT_028_EPD || INTERFACE_USED == CY8CKIT_028_TFT))
    #error "Error: Incorrect configuration for the macro 'INTERFACE_USED' in motion_task.h. " \
           "The kits that do not have Arduino form factor do not support the EPD or TFT shields. "\
           "Use a custom interface instead."
#else
    /* Assign the PSoC 6 GPIO Interrupt pin according to the interface (shield)
     * and the interrupt channel being configured in  'motion_task.h'.
     */
    #if (INTERFACE_USED == CY8CKIT_028_EPD)
        #if (IMU_INTERRUPT_CHANNEL == 1)
            #define IMU_INTERRUPT_PIN        (CYBSP_D9)
        #elif (IMU_INTERRUPT_CHANNEL == 2)
            #define IMU_INTERRUPT_PIN        (CYBSP_D8)
        #endif
    #elif (INTERFACE_USED == CY8CKIT_028_TFT)
        #if (IMU_INTERRUPT_CHANNEL == 1)
            #define IMU_INTERRUPT_PIN        (CYBSP_A2)
        #elif (IMU_INTERRUPT_CHANNEL == 2)
            #define IMU_INTERRUPT_PIN        (CYBSP_A3)
        #endif
    #elif (INTERFACE_USED == CUSTOM_INTERFACE)
        #define IMU_INTERRUPT_PIN            (CUSTOM_INTERRUPT_PIN)
    #elif (INTERFACE_USED == SHIELD_XENSIV_A)
        #define IMU_INTERRUPT_PIN            (CYBSP_D7)
    #else
        #error "Error: Incorrect configuration for the macro 'INTERFACE_USED' macro in motion_task.h"
    #endif

    /* Compile-time error checking for other macros in 'motion_task.h' */
    #if (IMU_INTERRUPT_CHANNEL != 1 && IMU_INTERRUPT_CHANNEL != 2)
        #error "Error: Incorrect configuration for the macro 'IMU_INTERRUPT_CHANNEL' in motion_task.h"
    #elif !defined(IMU_INTERRUPT_PIN)
        #error "Error: Incorrect configuration for the macro 'IMU_INTERRUPT_PIN' in motion_task.h"
    #endif
#endif

/*******************************************************************************
* Global Variables
********************************************************************************/
/* Orientation types:
 * Indicates which edge of the board is pointing towards the ceiling/sky
 */
typedef enum
{
    ORIENTATION_NULL            = 0,    /* Default orientation state used for initialization purposes */
    ORIENTATION_TOP_EDGE        = 1,    /* Top edge of the board points towards the ceiling */
    ORIENTATION_BOTTOM_EDGE     = 2,    /* Bottom edge of the board points towards the ceiling */
    ORIENTATION_LEFT_EDGE       = 3,    /* Left edge of the board (USB connector side) points towards the ceiling */
    ORIENTATION_RIGHT_EDGE      = 4,    /* Right edge of the board points towards the ceiling */
    ORIENTATION_DISP_UP         = 5,    /* Display faces up (towards the sky/ceiling) */
    ORIENTATION_DISP_DOWN       = 6     /* Display faces down (towards the ground) */
} orientation_t;

#if (INTERFACE_USED != SHIELD_XENSIV_A)
/* Instance of BMI160 sensor structure */
static mtb_bmi160_t motion_sensor;
#else
/* Instance of BMI270 sensor structure */
mtb_bmi270_data_t data;
mtb_bmi270_t sensor_bmi270;
#endif

