Infineon/mtb-example-psoc6-motion-sensor-freertos/motion_task.c
/* HAL structure for I2C */
static cyhal_i2c_t kit_i2c;

/* Motion sensor task handle */
static TaskHandle_t motion_sensor_task_handle;

/* Handle for the semaphore that locks the I2C resource while reading the
 * Motion Sensor data
 */
static SemaphoreHandle_t i2c_semaphore;

/*******************************************************************************
* Function Prototypes
********************************************************************************/
/* These static functions are used by the Motion Sensor Task. These are not
 * available outside this file. See the respective function definitions for
 * more details.
 */
static void task_motion(void* pvParameters);
static cy_rslt_t motionsensor_init(void);
static cy_rslt_t motionsensor_config_interrupt(void);
static cy_rslt_t motionsensor_update_orientation(orientation_t *orientation_result);
static void motionsensor_interrupt_handler(void *handler_arg, cyhal_gpio_event_t event);

/*******************************************************************************
* Function Name: create_motion_sensor_task
********************************************************************************
* Summary:
*  Function that creates the motion sensor task.
*
* Parameters:
*  None
*
* Return:
*  CY_RSLT_SUCCESS upon successful creation of the motion sensor task, else a
*  non-zero value that indicates the error.
*
*******************************************************************************/
cy_rslt_t create_motion_sensor_task(void)
{
    BaseType_t status;

    status = xTaskCreate(task_motion, "Motion Sensor Task", TASK_MOTION_SENSOR_STACK_SIZE,
                         NULL, TASK_MOTION_SENSOR_PRIORITY, &motion_sensor_task_handle);

    return (status == pdPASS) ? CY_RSLT_SUCCESS : (cy_rslt_t) status;
}

/*******************************************************************************
* Function Name: task_motion
********************************************************************************
* Summary:
*  Task that configures the Motion Sensor and processes the sensor data to
*  display the sensor orientation.
*
* Parameters:
*  void *pvParameters : Task parameter defined during task creation (unused)
*
* Return:
*  None
*
*******************************************************************************/
static void task_motion(void* pvParameters)
{
    /* Status variable to indicate the result of various operations */
    cy_rslt_t result;

    /* Variable used to store the orientation information */
    orientation_t orientation;

    /* Remove warning for unused parameter */
    (void)pvParameters;

    /* \x1b[2J\x1b[;H - ANSI ESC sequence for clear screen */
    printf("\x1b[2J\x1b[;H");

    printf("***************************************************************************\n");
    printf("            PSoC 6 MCU: Motion sensor interfacing using I2C                \n");
    printf("***************************************************************************\n");

    /* Create binary semaphore and suspend the task upon failure */
    i2c_semaphore = xSemaphoreCreateBinary();
    CHECK_RESULT((i2c_semaphore == NULL), " Error : Motion Sensor - Failed to create semaphore !!\n");
    xSemaphoreGive(i2c_semaphore);

    /* Initialize IMU motion sensor and suspend the task upon failure */
    result = motionsensor_init();
    CHECK_RESULT(result, " Error : Motion Sensor initialization failed !!\n Check hardware connection. [Error code: 0x%lx]\n", (long unsigned int)result);
    printf(" Motion Sensor successfully initialized.\n");

    /* Configure orientation interrupt and suspend the task upon failure */
    result = motionsensor_config_interrupt();
    CHECK_RESULT(result, " Error : Motion Sensor interrupt configuration failed !!\n [Error code: 0x%lx]\n", (long unsigned int)result);
    printf(" Motion Sensor interrupts successfully configured and enabled.\n\n\n");

    for(;;)
    {
        /* Get current orientation */
        result = motionsensor_update_orientation(&orientation);
        CHECK_RESULT(result, " Error : Could not read motion sensor data !!\n [Error code: 0x%lx]\n", (long unsigned int)result);

        /* Print the orientation in the same line.
         * \x1b[1F - ANSI ESC sequence to move cursor to the previous line.
         */
        switch(orientation)
        {
            case ORIENTATION_TOP_EDGE:
                printf("\x1b[1FOrientation = TOP_EDGE   \n");
                break;
            case ORIENTATION_BOTTOM_EDGE:
                printf("\x1b[1FOrientation = BOTTOM_EDGE\n");
                break;
            case ORIENTATION_LEFT_EDGE:
                printf("\x1b[1FOrientation = LEFT_EDGE  \n");
                break;
            case ORIENTATION_RIGHT_EDGE:
                printf("\x1b[1FOrientation = RIGHT_EDGE \n");
                break;
            case ORIENTATION_DISP_UP:
                printf("\x1b[1FOrientation = DISP_UP    \n");
                break;
            case ORIENTATION_DISP_DOWN:
                printf("\x1b[1FOrientation = DISP_DOWN  \n");
            default:
                break;
        }

        /* Wait for notification from ISR. The ISR will notify the task upon
         * receiving interrupt from the Motion Sensor on orientation change.
         */
        xTaskNotifyWait(0, 0, NULL, portMAX_DELAY);
    }
}

/*******************************************************************************
* Function Name: motionsensor_init
********************************************************************************
* Summary:
*  Function that configures the I2C master interface and then initializes
*  the motion sensor.
*
* Parameters:
*  None
*
* Return:
*  CY_RSLT_SUCCESS upon successful initialization of the motion sensor, else a
*  non-zero value that indicates the error.
*
*******************************************************************************/
static cy_rslt_t motionsensor_init(void)
{
    /* Status variable */
    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* I2C configuration structure */
    cyhal_i2c_cfg_t kit_i2c_cfg = {
        .is_slave = false,
        .address = 0,
        .frequencyhal_hz = I2C_CLK_FREQ_HZ
    };

    /* Block the I2C resource while initializing I2C and the motion sensor */
    xSemaphoreTake(i2c_semaphore, portMAX_DELAY);

    /* Initialize the I2C master interface for BMI160 motion sensor */
    result = cyhal_i2c_init(&kit_i2c, (cyhal_gpio_t) CYBSP_I2C_SDA,
                            (cyhal_gpio_t) CYBSP_I2C_SCL, NULL);
    CHECK_RESULT(result, " Error : I2C initialization failed !!\n [Error code: 0x%lx]\n", (long unsigned int)result);

    /* Configure the I2C master interface with the desired clock frequency */
    result = cyhal_i2c_configure(&kit_i2c, &kit_i2c_cfg);
    CHECK_RESULT(result, " Error : I2C configuration failed !!\n [Error code: 0x%lx]\n", (long unsigned int)result);

    /* Initialize the IMU motion sensor */
#if (INTERFACE_USED != SHIELD_XENSIV_A)
    result = mtb_bmi160_init_i2c(&motion_sensor, &kit_i2c, MTB_BMI160_DEFAULT_ADDRESS);
#else
    result = mtb_bmi270_init_i2c(&sensor_bmi270, &kit_i2c, MTB_BMI270_ADDRESS_SEC);
    CY_ASSERT(CY_RSLT_SUCCESS == result);
    result = mtb_bmi270_config_default(&sensor_bmi270);
#endif

    /* Release the I2C resource after initializing the motion sensor */
    xSemaphoreGive(i2c_semaphore);

    return result;
}

