Infineon/mtb-example-psoc6-motion-sensor-freertos/motion_task.c
/*******************************************************************************
* Function Name: motionsensor_interrupt_handler
********************************************************************************
* Summary:
*  Interrupt service routine(ISR) for orientation interrupts from motion sensor.
*  The ISR notifies the Motion sensor task.
*
* Parameters:
*  void *handler_arg            : Pointer to variable passed to the ISR (unused)
*  cyhal_gpio_irq_event_t event : GPIO event type (unused)
*
* Return:
*  None
*
*******************************************************************************/
static void motionsensor_interrupt_handler(void *handler_arg, cyhal_gpio_event_t event)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    /* To avoid compiler warnings */
    (void)handler_arg;
    (void)event;

    /* Notify the Motion sensor task */
    xTaskNotifyFromISR(motion_sensor_task_handle, 0, eNoAction, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
}

/*******************************************************************************
* Function Name: motionsensor_config_interrupt
********************************************************************************
* Summary:
*  Configures the motion sensor to detect change in orientation. This functions
*  sets up the motion sensor to provide a pulse on orientation change and
*  configures the active level and pulse width.
*
* Parameters:
*  None
*
* Return:
*  CY_RSLT_SUCCESS upon successful orientation interrupt configuration, else a
*  non-zero value that indicates the error.
*
*******************************************************************************/
static cy_rslt_t motionsensor_config_interrupt(void)
{
#if (INTERFACE_USED != SHIELD_XENSIV_A)
    /* Structure for storing interrupt configuration */
    struct bmi160_int_settg int_config;

    /* Status variable */
    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* Map the orientation interrupt to the interrupt pin specified by the
     * 'IMU_INTERRUPT_CHANNEL' macro.
     */
    int_config.int_channel = (IMU_INTERRUPT_CHANNEL == 1) ? BMI160_INT_CHANNEL_1 :
                             BMI160_INT_CHANNEL_2;
    /* Select the Interrupt type as Orientation interrupt */
    int_config.int_type = BMI160_ACC_ORIENT_INT;

    /* Interrupt pin configuration */
    /* Enabling interrupt pins to act as output pin */
    int_config.int_pin_settg.output_en = BMI160_ENABLE;
    /* Choosing push-pull mode for interrupt pin */
    int_config.int_pin_settg.output_mode = BMI160_DISABLE;
    /* Choosing active High output */
    int_config.int_pin_settg.output_type = BMI160_ENABLE;
    /* Choosing edge triggered output */
    int_config.int_pin_settg.edge_ctrl = BMI160_ENABLE;
    /* Disabling interrupt pin to act as input */
    int_config.int_pin_settg.input_en = BMI160_DISABLE;
    /* 5 ms latched output */
    int_config.int_pin_settg.latch_dur = BMI160_LATCH_DUR_5_MILLI_SEC;

    /* Interrupt type configuration */
    /* No exchange axis */
    int_config.int_type_cfg.acc_orient_int.axes_ex = 1;
    /* Set orientation blocking */
    int_config.int_type_cfg.acc_orient_int.orient_blocking = 0;
    /* Set orientation hysteresis */
    int_config.int_type_cfg.acc_orient_int.orient_hyst = 2;
    /* Set orientation interrupt mode */
    int_config.int_type_cfg.acc_orient_int.orient_mode = 0;
    /* Set orientation interrupt theta */
    int_config.int_type_cfg.acc_orient_int.orient_theta = 0;
    /* Enable orientation */
    int_config.int_type_cfg.acc_orient_int.orient_en = 1;
    /* Enable orientation interrupt */
    int_config.int_type_cfg.acc_orient_int.orient_ud_en = 1;

    /* Block the I2C resource while configuring the motion sensor */
    xSemaphoreTake(i2c_semaphore, portMAX_DELAY);

    /* Configure the BMI160 interrupt */
    result = mtb_bmi160_config_int(&motion_sensor, &int_config, (cyhal_gpio_t) IMU_INTERRUPT_PIN,
                                   IMU_INTERRUPT_PRIORITY, CYHAL_GPIO_IRQ_RISE,
                                   motionsensor_interrupt_handler, NULL);

    /* Release the I2C resource after configuring the motion sensor */
    xSemaphoreGive(i2c_semaphore);

    return result;
#else
    /* Structures for storing interrupt configuration */
    struct bmi2_int_pin_config pin_config = {0};

    /* Status variable */
    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* Get the default interrupt pin configurations using the BMI270_SensorAPI library function */
    result = bmi2_get_int_pin_config(&pin_config, &(sensor_bmi270.sensor));
    if (result != BMI2_OK)
    {
        CY_ASSERT(0);
    }

    /* Interrupt pin configuration */
    pin_config.pin_type = (IMU_INTERRUPT_CHANNEL == 1) ? BMI2_INT1 :
                             BMI2_INT2;
    pin_config.int_latch = BMI2_INT_NON_LATCH;
    pin_config.pin_cfg[0].input_en = BMI2_INT_INPUT_DISABLE;
    pin_config.pin_cfg[0].lvl = BMI2_INT_ACTIVE_LOW;
    pin_config.pin_cfg[0].od = BMI2_INT_PUSH_PULL;
    pin_config.pin_cfg[0].output_en = BMI2_INT_OUTPUT_ENABLE;

    /* Map data ready interrupt to interrupt pin using the BMI270_SensorAPI library function */
    result = bmi2_map_data_int(BMI2_DRDY_INT, ((IMU_INTERRUPT_CHANNEL == 1) ?
                BMI2_INT1 : BMI2_INT2), &(sensor_bmi270.sensor));
    if (result != BMI2_OK)
    {
        CY_ASSERT(0);
    }

    /* Configure the BMI270 interrupt */
    result = mtb_bmi270_config_int(&sensor_bmi270, &pin_config, (cyhal_gpio_t) IMU_INTERRUPT_PIN,
                    IMU_INTERRUPT_PRIORITY, CYHAL_GPIO_IRQ_FALL,
                    motionsensor_interrupt_handler, NULL);

    /* Release the I2C resource after configuring the motion sensor */
    xSemaphoreGive(i2c_semaphore);

    return result;
#endif
}

/*******************************************************************************
* Function Name: motionsensor_update_orientation
********************************************************************************
* Summary:
*  Function that updates the orientation status to one of the 6 types, see
*  'orientation_t'. This functions detects the axis that is most perpendicular
*  to the ground based on the absolute value of acceleration in that axis.
*  The sign of the acceleration signifies whether the axis is facing the ground
*  or the opposite.
*
* Parameters:
*  orientation_t *orientation_result: Address of the variable that stores the
*                                     orientation information.
*
* Return:
*  CY_RSLT_SUCCESS upon successful orientation update, else a non-zero value
*  that indicates the error.
*
*******************************************************************************/
static cy_rslt_t motionsensor_update_orientation(orientation_t *orientation_result)
{
    /* Status variable */
    cy_rslt_t result = CY_RSLT_SUCCESS;

