Infineon/mtb-example-psoc6-motion-sensor-freertos/motion_task.c
    /* Structure to store the accelerometer and gyroscope data read from the
     * IMU motion sensor
     */
#if (INTERFACE_USED != SHIELD_XENSIV_A)
    mtb_bmi160_data_t data;
#endif

    /* Variables used to store absolute values of the accelerometer data */
    uint16_t abs_x, abs_y, abs_z;

    if(orientation_result == NULL)
    {
#if (INTERFACE_USED != SHIELD_XENSIV_A)
        result = BMI160_E_NULL_PTR;
#else
    result = BMI2_E_NULL_PTR;
#endif
    }
    else
    {
        /* Clear the previous orientation data */
        *orientation_result = ORIENTATION_NULL;

        /* Block the I2C resource while reading the motion sensor data */
        xSemaphoreTake(i2c_semaphore, portMAX_DELAY);

        /* Read x, y, z components of acceleration */
#if (INTERFACE_USED != SHIELD_XENSIV_A)
        result = mtb_bmi160_read(&motion_sensor, &data);
#else
        result =  mtb_bmi270_read(&sensor_bmi270, &data);
#endif

        /* Release the I2C resource after reading the motion sensor data */
        xSemaphoreGive(i2c_semaphore);

        if (result == CY_RSLT_SUCCESS)
        {
#if (INTERFACE_USED != SHIELD_XENSIV_A)
            /* Get the absolute values of the accelerations along each axis */
            abs_x = abs(data.accel.x);
            abs_y = abs(data.accel.y);
            abs_z = abs(data.accel.z);
#else
            abs_x = abs(data.sensor_data.acc.x);
            abs_y = abs(data.sensor_data.acc.y);
            abs_z = abs(data.sensor_data.acc.z);
#endif

            /* Z axis (perpendicular to face of the display) is most aligned with
             * gravity.
             */
            if ((abs_z > abs_x) && (abs_z > abs_y))
            {
#if (INTERFACE_USED != SHIELD_XENSIV_A)
                if (data.accel.z < 0)
                {
                    /* Display faces down (towards the ground) */
                    *orientation_result = ORIENTATION_DISP_DOWN;
                }
#else
                if (data.sensor_data.acc.z < 0)
                {
                    /* Display faces down (towards the ground) */
                    *orientation_result = ORIENTATION_DISP_DOWN;
                }
#endif
                else
                {
                    /* Display faces up (towards the sky/ceiling) */
                    *orientation_result = ORIENTATION_DISP_UP;
                }
            }
            /* Y axis (parallel with shorter edge of board) is most aligned with
             * gravity.
             */
            else if ((abs_y > abs_x) && (abs_y > abs_z))
            {
#if (INTERFACE_USED != SHIELD_XENSIV_A)
                if (data.accel.y > 0)
                {
                    /* Display has an inverted landscape orientation */
                    *orientation_result = ORIENTATION_BOTTOM_EDGE;
                }
                else
                {
                    /* Display has landscape orientation */
                    *orientation_result = ORIENTATION_TOP_EDGE;
                }
#else
                if (data.sensor_data.acc.y > 0)
                {
                    /* Display has an inverted landscape orientation */
                    *orientation_result = ORIENTATION_TOP_EDGE;
                }
                else
                {
                    /* Display has landscape orientation */
                    *orientation_result = ORIENTATION_BOTTOM_EDGE;
                }
#endif
            }
            /* X axis (parallel with longer edge of board) is most aligned with
             * gravity.
             */
            else
            {
#if (INTERFACE_USED != SHIELD_XENSIV_A)
                if (data.accel.x < 0)
                {
                    /* Display has an inverted portrait orientation */
                    *orientation_result = ORIENTATION_RIGHT_EDGE;
                }
                else
                {
                    /* Display has portrait orientation */
                    *orientation_result = ORIENTATION_LEFT_EDGE;
                }
#else
                if (data.sensor_data.acc.x < 0)
                {
                    /* Display has an inverted portrait orientation */
                    *orientation_result = ORIENTATION_LEFT_EDGE;
                }
                else
                {
                    /* Display has portrait orientation */
                    *orientation_result = ORIENTATION_RIGHT_EDGE;
                }
#endif
            }
        }
    }

    return result;
}

/* [] END OF FILE */
